k_Epsilon_transient/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 16.6 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    wall1
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    wall2
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    wall3
    {
        type            noSlip;
    }
    wall4
    {
        type            noSlip;
    }
    wall5
    {
        type            noSlip;
    }

    frontwall
    {
        type            symmetry;
    }
    backwall
    {
        type            symmetry;
    }
}

// ************************************************************************* //
